var that;
import Api from '../../../config/api';
import CustomPage from '../../../CustomPage';
CustomPage({

  data: {
    open:'-1',
    coughQuestions: [{
      title: "近两周来，咳嗽会让您胸痛或肚子痛吗?",
      type: "psychic",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，您会因咳嗽有痰而烦恼吗?",
      type: "psychic",
      checks: ['每次都会', '多数时间会', '不时会', '有时会', '偶尔会', '极少会', '从来不会']
  }, {
      title: "近两周来，咳嗽会让您感到疲倦吗?",
      type: "psychic",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，您觉得能控制咳嗽吗?",
      type: "mand",
      checks: ['一点也不能', '几乎不能', '很少能', '有时能', '常常能', '多数时间能', '一直都能']
  }, {
      title: "近两周来，咳嗽会让您觉得尴尬吗?",
      type: "mand",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，咳嗽会让您焦虑不安吗?",
      type: "mand",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，咳嗽会影响您的工作或其他日常事务吗?",
      type: "society",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，咳嗽会影响您的整个娱乐生活吗?",
      type: "society",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，接触油漆油烟会让您咳嗽吗?",
      type: "psychic",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，咳嗽会影响您的睡眠吗?",
      type: "psychic",
      checks: ['一直都会', '大多数时间会', '常常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，您每天阵发性咳嗽发作多吗?",
      type: "psychic",
      checks: ['持续有', '次数多', '时时有', '有一些', '偶尔有', '极少有', '一点也没有']
  }, {
      title: "近两周来，您会因咳嗽而情绪低落吗?",
      type: "mand",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，咳嗽会让您厌烦吗?",
      type: "mand",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，咳嗽会让您声音嘶哑吗?",
      type: "psychic",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，您会觉得精力充沛吗?",
      type: "psychic",
      checks: ['一点也不会 ', '几乎不会', '很少会', '有时会', '常常会', '多数时间会', '一直都会']
  }, {
      title: "近两周来，咳嗽会让您担心有可能得了重病吗?",
      type: "mand",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，咳嗽会让您担心别人觉得您身体不对劲吗?",
      type: "mand",
      checks: ['一直都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，您会因咳嗽中断谈话或接听电话吗?",
      type: "society",
      checks: ['每次都会', '大多数时间会', '时常会', '有时会', '很少会', '几乎不会', '一点也不会']
  }, {
      title: "近两周来，您会觉得咳嗽惹恼了同伴?家人或朋友?",
      type: "society",
      checks: ['每次都会', '多数时间会 ', '不时会 ', '有时会', '偶尔会', '极少会', '从来不会']
  }],
    questions: ["休息", "您自己按照习惯的步点走路", "与您的同龄人一起走路", "爬山", "爬楼梯", "吃饭", "从椅子上坐起来", "刷牙", "剃须或者梳头", "洗澡", "穿衣", "收拾屋子", "洗碟子", "扫地、吸尘", "叠被子", "购物", "洗衣服", "洗车", "修剪草坪", "给草坪浇水", "性生活", "气短", "害怕因用力过猛而导致伤害", "害怕会气短"],
  },

  async onLoad(options) {
    that = this;
    console.log(options)
    let res = await Api.detailReport(options);
    console.log(res);
    that.setData({
      reportForm: res.data.report
    })
  },
  open(e){
    console.log(e);
    let open = that.data.open;
    let index = e.currentTarget.dataset.index;
    if(open == index){
      index = -1;
    }
    that.setData({
      open:index
    })


  }

})